app/Http/Controllers/CompetenciaController.php

    public function index()
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Competencias', 'url' => route('competencias.index')],


        ];
        $competencias = Competencia::with('documentos', 'eventos')->paginate(10)->through(function ($competencia) {
            // Ejemplo: transformar el código de categoría a texto (puede venir de una relación o lógica)
            $competencia->categoria_nombre = Catalogo::where('catalogo_codigo', $competencia->codigo_categoria)->first()->catalogo_descripcion;
            return $competencia;
        });
---
select * from `competencias` limit 10 offset 0
select * from `eventos` where `eventos`.`competencia_id` in (1, 2)
select count(*) as aggregate from `competencias`
select * from `catalogos` where `catalogo_codigo` = 'CC-001' limit 1

    public function create()
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Catalogo', 'url' => route('catalogos.index')],
            ['name' => 'Crear Categoria', 'url' => route('categorias.index')],

        ];

        $categorias = Catalogo::where('categoria_id', 7)->get();
---
select * from `catalogos` where `categoria_id` = 7

    public function edit($id)
    {

        $competencia = Competencia::findOrFail($id);

        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Competencias', 'url' => route('competencias.index')],
            ['name' => 'Editar Competencia', 'url' => route('competencias.index')],

        ];
        $categorias = Catalogo::where('categoria_id', 7)->get();
---
select * from `competencias` where `competencias`.`id` = '1' limit 1
select * from `catalogos` where `categoria_id` = 7