app/Http/Controllers/DocumentoCompetenciaController.php

    public function store(Request $request, Competencia $competencia)
    {
        $request->validate([

            'documento_nombre' => 'required|string|max:255',
            'documento_ruta' => 'required|file|mimes:pdf,doc,docx,zip|max:2048',
            'accion_usuario' => 'nullable|string|max:255',
        ]);

        if ($request->hasFile('documento_ruta')) {
            $file = $request->file('documento_ruta');
            $filename = Str::uuid() . '.' . $file->getClientOriginalExtension();
            $file->move(public_path('documentos'), $filename);
            $path = 'documentos/' . $filename;
        }

        DocumentoCompetencia::create([
            'competencia_id' => $competencia->id,
            'documento_nombre' => $request->documento_nombre,
            'documento_ruta' => $path,
            'accion_usuario' => Auth::user()->name,
        ]);
---
insert into `documento_competencias` (`competencia_id`, `documento_nombre`, `documento_ruta`, `accion_usuario`, `updated_at`, `created_at`) values (1, 'Doc 1 de prueba', 'documentos/QEXh7Wldo5DDwAdzWSsaRJQKJqeXGfY9FhcG1DuA.pdf', 'admin', '2025-06-02 16:08:55', '2025-06-02 16:08:55')