app/Http/Controllers/EventoController.php

select * from `competencias` where `competencias`.`id` in (1, 2)
select * from `eventos` limit 10 offset 0
select count(*) as aggregate from `eventos`
---
    public function index(Request $request)
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Eventos', 'url' => route('eventos.index')],


        ];
        $query = Evento::with('competencia');

        if ($request->has('search') && $request->search != '') {
            $search = $request->search;

            $query->where(function ($q) use ($search) {
                // Buscar en campos del evento
                $q->where('ubicacion', 'like', "%$search%")
                    ->orWhere('fecha', 'like', "%$search%")
                    // Buscar en relación competencia, por ejemplo nombre
                    ->orWhereHas('competencia', function ($q2) use ($search) {
                        $q2->where('nombre', 'like', "%$search%");
                    });
            });
        }

        $eventos = $query->paginate(10);

select * from `competencias`
---
    public function create()
    {
        $breadcrumb = [
            ['name' => 'Inicio', 'url' => route('home')],
            ['name' => 'Eventos', 'url' => route('eventos.index')],
            ['name' => 'Crear Evento', 'url' => route('eventos.index')],

        ];
        $competencias = Competencia::all();